src/test/resources/apiXml/JLR/GetJobs_AllJobs.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:men="http://www.cliffordthames.com/ebusiness/menus/">
<soapenv:Header/>
<soapenv:Body>
   <getJobs xmlns="http://www.cliffordthames.com/ebusiness/menus/">
      <jobsRequest>
         <men:dealerDetails countryCode="GB" dealerIdentificationCode="Automation" languageCode="EN" manufacturer="JLR" password="O3Cg0d3l751" user="Automation" vehicleFileID="0"/>
         <vehicleMatch>
            <vinMatch>SALWA2AKXJA194544</vinMatch>
         </vehicleMatch>
      </jobsRequest>
   </getJobs>
</soapenv:Body>
</soapenv:Envelope>